## 🧾 Terraform Plan for `iam_role`

> ⚠️ Review this carefully before applying changes

```hcl
module.eks_irsa_role.data.aws_iam_policy_document.assume_role: Reading...
module.iam_role.data.aws_iam_policy_document.assume_role: Reading...
module.github_actions_role.data.aws_iam_policy_document.assume_role: Reading...
module.iam_role.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=1423484585]
module.github_actions_role.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2487025436]
module.eks_irsa_role.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=1995518740]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.eks_irsa_role.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::111222334343:oidc-provider/https://oidc.eks.us-west-2.amazonaws.com/id/EXAMPLE1234567890"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-irsa-myapp"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags                  = {
          + "App"         = "myapp"
          + "Environment" = "prod"
        }
      + tags_all              = {
          + "App"         = "myapp"
          + "Environment" = "prod"
        }
      + unique_id             = (known after apply)
    }

  # module.eks_irsa_role.aws_iam_role_policy.inline["eks-irsa-inline"] will be created
  + resource "aws_iam_role_policy" "inline" {
      + id     = (known after apply)
      + name   = "eks-irsa-inline"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:GetObject",
                          + "s3:PutObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::myapp-bucket/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = "eks-irsa-myapp"
    }

  # module.eks_irsa_role.aws_iam_role_policy_attachment.managed["arn:aws:iam::aws:policy/AmazonS3ReadOnlyAccess"] will be created
  + resource "aws_iam_role_policy_attachment" "managed" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonS3ReadOnlyAccess"
      + role       = "eks-irsa-myapp"
    }

  # module.github_actions_role.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:sub" = "repo:bluebit/myrepo:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::123456789012:oidc-provider/token.actions.githubusercontent.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "github-deploy-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags                  = {
          + "Environment" = "staging"
          + "Owner"       = "bluebit"
        }
      + tags_all              = {
          + "Environment" = "staging"
          + "Owner"       = "bluebit"
        }
      + unique_id             = (known after apply)
    }

  # module.github_actions_role.aws_iam_role_policy.inline["github-actions-deploy"] will be created
  + resource "aws_iam_role_policy" "inline" {
      + id     = (known after apply)
      + name   = "github-actions-deploy"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:*",
                          + "cloudfront:CreateInvalidation",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = "github-deploy-role"
    }

  # module.github_actions_role.aws_iam_role_policy_attachment.managed["arn:aws:iam::aws:policy/CloudWatchLogsFullAccess"] will be created
  + resource "aws_iam_role_policy_attachment" "managed" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/CloudWatchLogsFullAccess"
      + role       = "github-deploy-role"
    }

  # module.iam_role.aws_iam_instance_profile.this[0] will be created
  + resource "aws_iam_instance_profile" "this" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "example-role-profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "example-role"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.iam_role.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "arn:aws:iam::123456789012:root"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "example-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + permissions_boundary  = "arn:aws:iam::123456789012:policy/ExamplePermissionsBoundary"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.iam_role.aws_iam_role_policy.inline["custom-policy"] will be created
  + resource "aws_iam_role_policy" "inline" {
      + id     = (known after apply)
      + name   = "custom-policy"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = "example-role"
    }

  # module.iam_role.aws_iam_role_policy_attachment.managed["arn:aws:iam::aws:policy/AmazonS3ReadOnlyAccess"] will be created
  + resource "aws_iam_role_policy_attachment" "managed" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonS3ReadOnlyAccess"
      + role       = "example-role"
    }

Plan: 10 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

<!-- Sticky Pull Request Comment -->